# IExportContextBase Interface (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExportContextBase Interface
Members See Also
---
An interface that as common base for IModelExportContext and IExportContext2D.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public interface IExportContextBase : IExportContext
```

Visual Basic
---
```text
Public Interface IExportContextBase _
	Inherits IExportContext
```

Visual C++
---
```text
public interface class IExportContextBase : IExportContext
```

# See Also
IExportContextBase Members
Autodesk.Revit.DB Namespace